console.log('Main (56)')
console.log('1. Проверка верстки +7');
console.log('верстка страницы валидная: для проверки валидности вёрстки используйте сервис https://validator.w3.org/ . ');
console.log('логотип в хедере состоит из текстовых элементов');
console.log('страница содержит ровно один элемент <h1>');
console.log('добавлен favicon +1');
console.log('2. Вёрстка соответствует макету +35');
console.log('блок <header> +5');
console.log('блок Not only +5');
console.log('блок About +5');
console.log('блок Our Friends +5');
console.log('блок Help +5');
console.log('блок In addition +5');
console.log('блок <footer> +5');
console.log('3. Требования к css +6');
console.log('для позиционирования элементов блока Help использована сеточная верстка (flexbox или grid)');
console.log('при уменьшении масштаба страницы браузера или увеличении ширины страницы (>1280px) вёрстка размещается по центру, \n а не сдвигается в сторону и не растягивается по всей ширине +2');
console.log('фоновый цвет тянется на всю ширину страницы +2');
console.log('4. Интерактивность элементов +10');
console.log('элемент About the Shelter в навигации подсвечен и неинтерактивен, остальные элементы навигации интерактивны +2');
console.log('каждая карточка с питомцем в блоке Our Friends интерактивна при наведении на любую область этой карточки 0');
console.log('плавная прокрутка по якорям +2');
console.log('выполняются все ссылочные связи согласно Перечню ссылочных связей для страницы Main +2');
console.log('выполнена интерактивность ссылок и кнопок. Интерактивность заключается не только в изменении внешнего вида курсора, например, при помощи свойства cursor: pointer, \n но и в использовании и других визуальных эффектов, например, изменение цвета фона или цвета шрифта, согласно стайлгайду в макете. \n Если в макете стили не указаны, реализуете их по своему усмотрению, руководствуясь общим стилем макета +2');
console.log('обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике, не влияющее на соседние элементы +0');
console.log('');

