
console.log('SHELTER_week_2');
console.log('              ');
console.log('Вёрстка страницы Main соответствует макету при ширине экрана 1280px:');
console.log('блок <header>');
console.log('блок Not only: ');
console.log('блок About: ');
console.log('блок Our Friends: ');
console.log('блок Help:');
console.log('блок In addition:');
console.log('блок <footer>: +2');
console.log('Вёрстка страницы Main соответствует макету при ширине экрана 768px:');
console.log('блок <header>');
console.log('блок Not only: ');
console.log('блок About: ');
console.log('блок Our Friends: ');
console.log('блок Help:');
console.log('блок In addition:');
console.log('блок <footer>: +2');
console.log('Вёрстка страницы Main соответствует макету при ширине экрана 320px: ');
console.log('блок <header>');
console.log('блок Not only: ');
console.log('блок About: ');
console.log('блок Our Friends: ');
console.log('блок Help:');
console.log('блок In addition:');
console.log('блок <footer>: +2');
console.log('Вёрстка страницы Pets соответствует макету при ширине экрана 1280px:');
console.log('блок <header>:');
console.log('блок Our Friends');
console.log('блок <footer>:');
console.log('Вёрстка страницы Pets соответствует макету при ширине экрана 768px');
console.log('блок <header>:');
console.log('блок Our Friends');
console.log('блок <footer>:');
console.log('Вёрстка страницы Pets соответствует макету при ширине экрана 320px:');
console.log('блок <header>:');
console.log('блок Our Friends');
console.log('блок <footer>:');
console.log('Ни на одном из разрешений до 320px включительно не появляется горизонтальная полоса прокрутки, справа от отдельных блоков не появляются белые поля. \n Весь контент страницы при этом сохраняется: не обрезается и не удаляется:');
console.log('нет полосы прокрутки при ширине страницы Main от 1280рх до 768рх: +5 \n нет полосы прокрутки при ширине страницы Main от 768рх до 320рх: +5 \n нет полосы прокрутки при ширине страницы Pets от 1280рх до 768рх: +5 \n нет полосы прокрутки при ширине страницы Pets от 768рх до 320рх: +5');
console.log('Верстка резиновая: при плавном изменении размера экрана от 1280px до 320px верстка подстраивается под этот размер, \n элементы верстки меняют свои размеры и расположение, не наезжают друг на друга, \n изображения могут менять размер, \n но сохраняют правильные пропорции: +8 \n на странице Main: +4 \n на странице Pets: +4');



/* 
console.log('Shelter_week_1')
console.log('             ');
console.log('Main (56)')
console.log('1. Проверка верстки +7');
console.log('верстка страницы валидная: для проверки валидности вёрстки используйте сервис https://validator.w3.org/ . +4');
console.log('логотип в хедере состоит из текстовых элементов +1');
console.log('страница содержит ровно один элемент <h1>');
console.log('добавлен favicon +1');
console.log('2. Вёрстка соответствует макету +35');
console.log('блок <header> +5');
console.log('блок Not only +5');
console.log('блок About +5');
console.log('блок Our Friends +5');
console.log('блок Help +5');
console.log('блок In addition +5');
console.log('блок <footer> +5');
console.log('3. Требования к css +6');
console.log('для позиционирования элементов блока Help использована сеточная верстка (flexbox или grid)');
console.log('при уменьшении масштаба страницы браузера или увеличении ширины страницы (>1280px) вёрстка размещается по центру, \n а не сдвигается в сторону и не растягивается по всей ширине +2');
console.log('фоновый цвет тянется на всю ширину страницы +2');
console.log('4. Интерактивность элементов +10');
console.log('элемент About the Shelter в навигации подсвечен и неинтерактивен, остальные элементы навигации интерактивны +2');
console.log('каждая карточка с питомцем в блоке Our Friends интерактивна при наведении на любую область этой карточки 0');
console.log('плавная прокрутка по якорям +2');
console.log('выполняются все ссылочные связи согласно Перечню ссылочных связей для страницы Main +2');
console.log('выполнена интерактивность ссылок и кнопок. Интерактивность заключается не только в изменении внешнего вида курсора, например, при помощи свойства cursor: pointer, \n но и в использовании и других визуальных эффектов, например, изменение цвета фона или цвета шрифта, согласно стайлгайду в макете. \n Если в макете стили не указаны, реализуете их по своему усмотрению, руководствуясь общим стилем макета +2');
console.log('обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике, не влияющее на соседние элементы +0');


 */